const প্রতিটির_জন্য = Array.prototype.forEach;
const প্রদর্শন = console.log;

const সূচক_নির্ণয় = (মান, বৃক্ষ, সূচক) => {
  if (!বৃক্ষ[সূচক]) return সূচক;

  const অভিভাবক_নোড = বৃক্ষ[সূচক];
  if (মান > অভিভাবক_নোড) {
    return সূচক_নির্ণয়(মান, বৃক্ষ, (2 * সূচক) + 2);
  }

  return সূচক_নির্ণয়(মান, বৃক্ষ, (2 * সূচক) + 1);
};

const নোড_সংযোজন = (মান, বৃক্ষ) => {
  if (বৃক্ষ.length === 0) {
    বৃক্ষ.push(মান);
    return;
  }

  const সূচক = সূচক_নির্ণয়(মান, বৃক্ষ, 0);

  বৃক্ষ[সূচক] = মান;
};

const মধ্যক্রম_ভ্রমণ = (বৃক্ষ, সূচক) => {
  if (!বৃক্ষ[সূচক]) return;

  মধ্যক্রম_ভ্রমণ(বৃক্ষ, (2 * সূচক) + 1);
  প্রদর্শন(বৃক্ষ[সূচক]);
  মধ্যক্রম_ভ্রমণ(বৃক্ষ, (2 * সূচক) + 2);
};

const পূর্বক্রম_ভ্রমণ = (বৃক্ষ, সূচক) => {
  if (!বৃক্ষ[সূচক]) return;

  প্রদর্শন(বৃক্ষ[সূচক]);
  পূর্বক্রম_ভ্রমণ(বৃক্ষ, (2 * সূচক) + 1);
  পূর্বক্রম_ভ্রমণ(বৃক্ষ, (2 * সূচক) + 2);
};

const উত্তরক্রম_ভ্রমণ = (বৃক্ষ, সূচক) => {
  if (!বৃক্ষ[সূচক]) return;

  উত্তরক্রম_ভ্রমণ(বৃক্ষ, (2 * সূচক) + 1);
  উত্তরক্রম_ভ্রমণ(বৃক্ষ, (2 * সূচক) + 2);
  প্রদর্শন(বৃক্ষ[সূচক]);
};

const প্রধান = () => {
  const বৃক্ষ = [];

  const শাখাসমূহ = [100, 20, 200, 10, 30, 150, 300]; // , 4, 5, 6, 7

  প্রতিটির_জন্য.call(শাখাসমূহ, (শাখা) => {
    নোড_সংযোজন(শাখা, বৃক্ষ);
  });
  প্রদর্শন({ বৃক্ষ });

  প্রদর্শন("মধ্যক্রম ভরমণ");
  মধ্যক্রম_ভ্রমণ(বৃক্ষ, 0);

  প্রদর্শন("পূর্বক্রম ভরমণ");
  পূর্বক্রম_ভ্রমণ(বৃক্ষ, 0);

  প্রদর্শন("উত্তরক্রম ভ্রমণ");
  উত্তরক্রম_ভ্রমণ(বৃক্ষ, 0);
};

প্রধান();
